Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.Rotation3D Property
Gets or sets value of 3d rotation.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Rotation3D Rotation3D { get; set; }
Public Property Rotation3D As Rotation3D
	Get
	Set
Property Value
Type: Rotation3D
See Also
Reference
ReferenceModel Class
Tekla.Structures.Model Namespace